OpenFOAM/montana-v2106/run/mhdFoam/Orszag_tang/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    minX
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       319200;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  maxX;
    }
    maxX
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       319600;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  minX;
    }
    minY
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       320000;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  maxY;
    }
    maxY
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       320400;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  minY;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          320000;
        startFace       320800;
    }
)

// ************************************************************************* //
