OpenFOAM/montana-v2106/run/mhdFoam/Orszag_tang/0_org/pB
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pB;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    minX
    {
        type            cyclic;
    }
    maxX
    {
        type            cyclic;
    }
    minY
    {
        type            cyclic;
    }
    maxY
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
